In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

In [3]:
!ls data

item_categories.csv
items.csv
sales_train.csv
shops.csv
test.csv

In [22]:
categories = pd.read_csv('data/item_categories.csv')
items = pd.read_csv('data/items.csv')
shops = pd.read_csv('data/shops.csv')
sales = pd.read_csv('data/sales_train.csv')
# test_data = pd.read_csv('data/test.csv')

In [23]:
sales

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day
0,02.01.2013,0,59,22154,999.00,1.0
1,03.01.2013,0,25,2552,899.00,1.0
2,05.01.2013,0,25,2552,899.00,-1.0
3,06.01.2013,0,25,2554,1709.05,1.0
4,15.01.2013,0,25,2555,1099.00,1.0
...,...,...,...,...,...,...
2935844,10.10.2015,33,25,7409,299.00,1.0
2935845,09.10.2015,33,25,7460,299.00,1.0
2935846,14.10.2015,33,25,7459,349.00,1.0
2935847,22.10.2015,33,25,7440,299.00,1.0
2935848,03.10.2015,33,25,7460,299.00,1.0

In [25]:
sales.item_id.describe()

count    2.935849e+06
mean     1.019723e+04
std      6.324297e+03
min      0.000000e+00
25%      4.476000e+03
50%      9.343000e+03
75%      1.568400e+04
max      2.216900e+04
Name: item_id, dtype: float64

In [24]:
test_data

            ID  shop_id  item_id
0            0        5     5037
1            1        5     5320
2            2        5     5233
3            3        5     5232
4            4        5     5268
...        ...      ...      ...
214195  214195       45    18454
214196  214196       45    16188
214197  214197       45    15757
214198  214198       45    19648
214199  214199       45      969

[214200 rows x 3 columns]

In [28]:
test_data.item_id.describe()

count    214200.000000
mean      11019.398627
std        6252.644590
min          30.000000
25%        5381.500000
50%       11203.000000
75%       16071.500000
max       22167.000000
Name: item_id, dtype: float64

In [31]:
sales

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day
0,02.01.2013,0,59,22154,999.00,1.0
1,03.01.2013,0,25,2552,899.00,1.0
2,05.01.2013,0,25,2552,899.00,-1.0
3,06.01.2013,0,25,2554,1709.05,1.0
4,15.01.2013,0,25,2555,1099.00,1.0
...,...,...,...,...,...,...
2935844,10.10.2015,33,25,7409,299.00,1.0
2935845,09.10.2015,33,25,7460,299.00,1.0
2935846,14.10.2015,33,25,7459,349.00,1.0
2935847,22.10.2015,33,25,7440,299.00,1.0
2935848,03.10.2015,33,25,7460,299.00,1.0

In [35]:
block_store_item_sum = sales.groupby(['date_block_num','shop_id', 'item_id']).item_cnt_day.sum()

In [41]:
shop_item_mean = block_store_item_sum.groupby(level=[1,2]).mean()

In [42]:
shop_item_mean

shop_id  item_id
0        30         31.000000
         31         11.000000
         32          8.000000
         33          3.000000
         35          7.500000
                      ...
59       22154       1.000000
         22155       1.000000
         22162       3.200000
         22164       1.500000
         22167       1.333333
Name: item_cnt_day, Length: 424124, dtype: float64

In [44]:
test_data

            ID  shop_id  item_id
0            0        5     5037
1            1        5     5320
2            2        5     5233
3            3        5     5232
4            4        5     5268
...        ...      ...      ...
214195  214195       45    18454
214196  214196       45    16188
214197  214197       45    15757
214198  214198       45    19648
214199  214199       45      969

[214200 rows x 3 columns]

In [47]:
merged = pd.merge(shop_item_mean.reset_index(), test_data)

In [53]:
merged.rename(columns={'item_cnt_day':'item_cnt_month'}).set_index('ID').item_cnt_month

ID
22987     1.000000
20994     1.600000
20995     1.375000
22492     1.100000
24827     1.000000
            ...
148798    2.000000
150983    1.000000
149575    3.200000
149242    1.500000
148377    1.333333
Name: item_cnt_month, Length: 111404, dtype: float64